OpenDTEF-v2012/tutorials/multiphase/interFoam/laminar/sloshingCylinder/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

mkdir -p constant/triSurface

cp -f $FOAM_TUTORIALS/resources/geometry/sloshingCylinder.obj.gz \
    constant/triSurface/

runApplication blockMesh

runApplication snappyHexMesh -overwrite

runApplication setFields

runApplication $(getApplication)

#------------------------------------------------------------------------------
